In [51]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from pprint import pprint
import random

In [52]:
grad_csv = pd.read_csv("adjusted_cohort_grdtn_rates_2010_2011.csv")
grad_df = pd.DataFrame(grad_csv)
grad_df = grad_df[["stnam", "leanm10", "ALL_RATE_1011"]]
grad_df= grad_df.rename(columns = {"stnam":"state", "leanm10": "county", "ALL_RATE_1011": "graduation_rate"})
grad_df.head()

     state            county graduation_rate
0  ALABAMA  Albertville City              80
1  ALABAMA   Marshall County              75
2  ALABAMA       Hoover City              89
3  ALABAMA      Madison City              91
4  ALABAMA        Leeds City           55-59

In [53]:
grad_df["state"]=grad_df.state.str.title()
grad_df["county"]=grad_df.county.str.title()
grad_df.head()

     state            county graduation_rate
0  Alabama  Albertville City              80
1  Alabama   Marshall County              75
2  Alabama       Hoover City              89
3  Alabama      Madison City              91
4  Alabama        Leeds City           55-59

In [54]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'District of Columbia': 'DC',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Northern Mariana Islands':'MP',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Palau': 'PW',
    'Pennsylvania': 'PA',
    'Puerto Rico': 'PR',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virgin Islands': 'VI',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}
grad_df['state'] = grad_df['state'].map(us_state_abbrev)
print(grad_df)

      state                                county graduation_rate
0        AL                      Albertville City              80
1        AL                       Marshall County              75
2        AL                           Hoover City              89
3        AL                          Madison City              91
4        AL                            Leeds City           55-59
...     ...                                   ...             ...
11281    WY  Sweetwater County School District #2           85-89
11282    WY    Washakie County School District #2              PS
11283    WY       Teton County School District #1           85-89
11284    WY      Weston County School District #7            GE80
11285    WY    Washakie County School District #1           75-79

[11286 rows x 3 columns]

In [55]:
#cleaning up the county names. removes the following words from that column
grad_df=grad_df.replace(regex=['County'], value='')
grad_df=grad_df.replace(regex=['Parish'], value='')
grad_df=grad_df.replace(regex=['City'], value='')
grad_df=grad_df.replace(regex=['Borough'], value='')
grad_df=grad_df.replace(regex=['Municipality'], value='')
grad_df=grad_df.replace(regex=['School'], value='')
grad_df=grad_df.replace(regex=['Schools'], value='')
grad_df=grad_df.replace(regex=['District'], value='')
grad_df=grad_df.replace(regex=['Dist.'], value='')
grad_df=grad_df.replace(regex=['Co  Dist'], value='')
grad_df=grad_df.replace(regex=['Co.'], value='')
grad_df=grad_df.replace(regex=['Dist'], value='')
grad_df=grad_df.replace(regex=['Regional'], value='')
grad_df=grad_df.replace(regex=['Local'], value='')
grad_df=grad_df.replace(regex=['Academy'], value='')
grad_df=grad_df.replace(regex=['Area'], value='')
grad_df=grad_df.replace(regex=['Uhs'], value='')
grad_df=grad_df.replace(regex=['Metropolitan'], value='')
grad_df=grad_df.replace(regex=['Community'], value='')
grad_df=grad_df.replace(regex=['Department'], value='')
grad_df=grad_df.replace(regex=['Unified'], value='')
grad_df=grad_df.replace(regex=['Chsd'], value='')
grad_df=grad_df.replace(regex=['Cusd'], value='')
grad_df=grad_df.replace(regex=['Public'], value='')
grad_df=grad_df.replace(regex=['Union High'], value='')
grad_df=grad_df.replace(regex=['Joint Unified'], value='')
grad_df=grad_df.replace(regex=['Public'], value='')
grad_df=grad_df.replace(regex=['(District)'], value='')
grad_df=grad_df.replace(regex=['H S'], value='')
grad_df=grad_df.replace(regex=['K- s'], value='')
grad_df=grad_df.replace(regex=['R-Iv'], value='')
grad_df=grad_df.replace(regex=['R-Iii'], value='')
grad_df=grad_df.replace(regex=['R-Ii'], value='')
grad_df=grad_df.replace(regex=['R-I'], value='')
grad_df=grad_df.replace(regex=['R-Ix'], value='')
grad_df=grad_df.replace(regex=['R-Xi'], value='')
grad_df=grad_df.replace(regex=['R-Xii'], value='')
grad_df=grad_df.replace(regex=['R-Xiii'], value='')
grad_df=grad_df.replace(regex=['R-X'], value='')
grad_df=grad_df.replace(regex=['R-Viii'], value='')
grad_df=grad_df.replace(regex=['R-Vii'], value='')
grad_df=grad_df.replace(regex=['R-Vi'], value='')
grad_df=grad_df.replace(regex=['R-V'], value='')
grad_df=grad_df.replace(regex=['Inc.'], value='')
grad_df=grad_df.replace(regex=['Central'], value='')
grad_df=grad_df.replace(regex=['Exempted Village'], value='')
grad_df=grad_df.replace(regex=['Sd'], value='')
grad_df=grad_df.replace(regex=['Union Free'], value='')
grad_df=grad_df.replace(regex=['Charter'], value='')
grad_df=grad_df.replace(regex=['Pblc Schs'], value='')
grad_df=grad_df.replace(regex=['No.'], value='')
grad_df=grad_df.replace(regex=['High School'], value='')
grad_df=grad_df.replace(regex=['#'], value='')
grad_df=grad_df.replace(regex=['  s'], value='')
grad_df['county'] = grad_df['county'].str.replace('(', '')
grad_df['county'] = grad_df['county'].str.replace(')', '')
grad_df['county'] = grad_df['county'].str.replace('\d+', '')
grad_df['county'] = grad_df['county'].str.strip()
grad_df['county'] = grad_df["county"].map(str.strip)
print(grad_df)

      state       county graduation_rate
0        AL  Albertville              80
1        AL     Marshall              75
2        AL       Hoover              89
3        AL      Madison              91
4        AL        Leeds           55-59
...     ...          ...             ...
11281    WY   Sweetwater           85-89
11282    WY     Washakie              PS
11283    WY        Teton           85-89
11284    WY       Weston            GE80
11285    WY     Washakie           75-79

[11286 rows x 3 columns]

In [56]:
#maine a lot were identified by only numbers. when stripped numbers need to drop rows all rsu
grad_df = grad_df[(grad_df.county != 'Rsu') & (grad_df.county != 'Msad') & (grad_df.county != 'Rsu /Msad')]

In [57]:
#if a range for graduation rate is given, taking the lower bound
grad_df['graduation_rate'] = grad_df['graduation_rate'].str.split('-').str[0]
print(grad_df)

      state       county graduation_rate
0        AL  Albertville              80
1        AL     Marshall              75
2        AL       Hoover              89
3        AL      Madison              91
4        AL        Leeds              55
...     ...          ...             ...
11281    WY   Sweetwater              85
11282    WY     Washakie              PS
11283    WY        Teton              85
11284    WY       Weston            GE80
11285    WY     Washakie              75

[11218 rows x 3 columns]

In [58]:
grad_df['graduation_rate'] = grad_df['graduation_rate'].str.extract('(\d+)', expand=False)
print(grad_df)

      state       county graduation_rate
0        AL  Albertville              80
1        AL     Marshall              75
2        AL       Hoover              89
3        AL      Madison              91
4        AL        Leeds              55
...     ...          ...             ...
11281    WY   Sweetwater              85
11282    WY     Washakie             NaN
11283    WY        Teton              85
11284    WY       Weston              80
11285    WY     Washakie              75

[11218 rows x 3 columns]

In [59]:
grad_df = grad_df.dropna(how='any')
print(grad_df)

      state       county graduation_rate
0        AL  Albertville              80
1        AL     Marshall              75
2        AL       Hoover              89
3        AL      Madison              91
4        AL        Leeds              55
...     ...          ...             ...
11280    WY      Fremont              80
11281    WY   Sweetwater              85
11283    WY        Teton              85
11284    WY       Weston              80
11285    WY     Washakie              75

[10979 rows x 3 columns]

In [60]:
grad_df["county"] = grad_df["county"].map(str) + ", "+ grad_df["state"]
grad_df.head()

  state           county graduation_rate
0    AL  Albertville, AL              80
1    AL     Marshall, AL              75
2    AL       Hoover, AL              89
3    AL      Madison, AL              91
4    AL        Leeds, AL              55

In [61]:
grad_df = grad_df[["county","graduation_rate"]]
grad_df.head()

            county graduation_rate
0  Albertville, AL              80
1     Marshall, AL              75
2       Hoover, AL              89
3      Madison, AL              91
4        Leeds, AL              55

In [62]:
county_raw = pd.read_excel("county_name.xls", sheet_name = "EDU01A", usecols = "A")

In [63]:
county = county_raw[~county_raw.Area_name.str.contains(",") == False]

In [64]:
county = county.reset_index(drop = True)
county = county.rename(columns={"Area_name": "county"})

In [65]:
pop_grad_rate = county.merge(grad_df, on="county")

In [66]:
pop_grad_rate.head()

        county graduation_rate
0  Autauga, AL              80
1  Baldwin, AL              74
2  Barbour, AL              50
3     Bibb, AL              73
4   Blount, AL              80

In [67]:
len(pop_grad_rate)

1464

In [69]:
pop_grad_rate.to_csv("test_graduation_cleaning.csv")

## Testing to see if can analyze now with county data so copied it over here

In [324]:
random_counties = county.sample(n=1400)
random_counties = random_counties.reset_index(drop=True)
random_counties.head()

       county
0  Jasper, TX
1  Marion, KY
2   Lamar, GA
3  Kenton, KY
4   Adams, IA

In [325]:
random_counties = random_counties.county.astype(str) #may need to do this in the counties doc could get same error for all when go to analyze
grad_rate_analysis = pd.DataFrame()
grad_rate_analysis["county"]=random_counties
grad_rate_analysis.head()

       county
0  Jasper, TX
1  Marion, KY
2   Lamar, GA
3  Kenton, KY
4   Adams, IA

In [326]:
grad_rate_analysis = grad_rate_analysis.merge(grad_df, on="county")
grad_rate_analysis.head()

          county state graduation_rate
0      Lamar, GA    GA              67
1  San Diego, CA    CA              85
2      Wayne, NY    NY              93
3      Adams, NE    NE              95
4   Cavalier, ND    ND              90

In [327]:
print(len(grad_rate_analysis))

663

In [329]:
grad_rate_analysis = grad_rate_analysis[["county", "graduation_rate"]]
grad_rate_analysis.head()

          county graduation_rate
0      Lamar, GA              67
1  San Diego, CA              85
2      Wayne, NY              93
3      Adams, NE              95
4   Cavalier, ND              90

In [330]:
print(len(grad_rate_analysis))

663